ERP.belugaerp/src/Documents/РасходныйОрдерНаТовары/РасходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РасходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>бг_ЕстьАлкогольнаяПродукция</name>
    <comment>// Признак что требуется ТТН</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЕстьМаркируемаяАлкогольнаяПродукция</name>
    <comment>// Признак что требуются марки</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_КонтролироватьСерии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОбязательнаяАгрегация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_РазрешитьПараллельнуюСборку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТипОтгрузкиWMS</name>
    <type>
      <types>EnumRef.бг_ТипыОтгрузкиWMS</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладскаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ТоварыПоРаспоряжениям</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>бг_СерияОбязательнаКОтбору</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>бг_ТребуемыйВидМарки</name>
      <type>
        <types>CatalogRef.бг_КлассификаторВидовМарок</types>
      </type>
    </attributes>
    <attributes>
      <name>бг_УпаковкаПаллета</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Распоряжение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтгружаемыеТовары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/InformationRegisters/бг_ДополнительныеСведенияПоЗаказамКлиентов/бг_ДополнительныеСведенияПоЗаказамКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_ДополнительныеСведенияПоЗаказамКлиентов</name>
  <resources>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаполненаОрганизацияЕГАИС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МаршрутныйЛист</name>
    <type>
      <types>DocumentRef.битМаршрутныйЛист</types>
    </type>
  </resources>
  <resources>
    <name>ОтражениеФактаПоРасходномуОрдеру</name>
    <type>
      <types>DocumentRef.битОтражениеФактаПоРасходномуОрдеру</types>
    </type>
  </resources>
  <resources>
    <name>ОтражениеФактаПоРасходномуОрдеруНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентСборки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РасходныйОрдер</name>
    <type>
      <types>DocumentRef.РасходныйОрдерНаТовары</types>
    </type>
  </resources>
  <resources>
    <name>РасходныйОрдерНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РеализацияТоваровУслуг</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </resources>
  <resources>
    <name>РеализацияТоваровУслугНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </resources>
  <resources>
    <name>СтатусSolvoОтражениеФактаПоРасходномуОрдеру</name>
    <type>
      <types>EnumRef.бг_СтатусыОтгрузкиSolvo</types>
    </type>
  </resources>
  <resources>
    <name>СуммаЗаказаИРеализацииСовпадают</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СуммаЗаказКлиента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТТНИсходящаяЕГАИС</name>
    <type>
      <types>DocumentRef.ТТНИсходящаяЕГАИС</types>
    </type>
  </resources>
  <resources>
    <name>ТТНИсходящаяЕГАИСНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТТНИсходящаяЕГАИССтатус</name>
    <type>
      <types>EnumRef.СтатусыОбработкиТТНИсходящейЕГАИС</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоЗаказМагазина</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоЗаказРозничногоПокупателя</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/Enums/бг_ТипыВнешнихСкладскихСистем/бг_ТипыВнешнихСкладскихСистем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_ТипыВнешнихСкладскихСистем</name>
  <enumValues>
    <name>MobileSmarts</name>
  </enumValues>
  <enumValues>
    <name>Solvo</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/бг_ИсточникиЗагрузкиЗаказовКлиентов/бг_ИсточникиЗагрузкиЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_ИсточникиЗагрузкиЗаказовКлиентов</name>
  <enumValues>
    <name>B2B</name>
  </enumValues>
  <enumValues>
    <name>Creatio</name>
  </enumValues>
  <enumValues>
    <name>EDI</name>
  </enumValues>
  <enumValues>
    <name>PortalDistr</name>
  </enumValues>
  <enumValues>
    <name>WINELAB_SAP</name>
  </enumValues>
  <enumValues>
    <name>WINELAB_SAP_СONSOLIDATED</name>
  </enumValues>
  <enumValues>
    <name>WINELAB_HYBRIS</name>
  </enumValues>
  <enumValues>
    <name>СобственныйКонтрагент</name>
  </enumValues>
  <enumValues>
    <name>ТвойДом</name>
  </enumValues>
  <enumValues>
    <name>Чикаго</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/бг_ТипыОтгрузкиWMS/бг_ТипыОтгрузкиWMS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_ТипыОтгрузкиWMS</name>
  <enumValues>
    <name>ОптовыйЗаказ</name>
  </enumValues>
  <enumValues>
    <name>ИнтернетЗаказ</name>
  </enumValues>
  <enumValues>
    <name>ПродажаЧерезМагазин</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/бг_ВариантыОтложеннойОбработкиОбъектов/бг_ВариантыОтложеннойОбработкиОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_ВариантыОтложеннойОбработкиОбъектов</name>
  <enumValues>
    <name>АвтоСогласованиеЗаказовКлиентов</name>
  </enumValues>
  <enumValues>
    <name>АктуализироватьОбеспечениеЗаказовКлиентов</name>
  </enumValues>
  <enumValues>
    <name>ИзменитьДатуСвязанныхУчетныхДокументов</name>
  </enumValues>
  <enumValues>
    <name>ОбработатьАкцизныеМарки</name>
  </enumValues>
  <enumValues>
    <name>ОбработатьДокументыWMS</name>
  </enumValues>
  <enumValues>
    <name>ОбработатьНовуюОрганизациюЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>ОбработатьПрисоединенныйФайлПисьма</name>
  </enumValues>
  <enumValues>
    <name>ОтправитьЗапросыСправки1ЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>ОтразитьДополнительныеСведенияЗаказаКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПередатьЗаказыКлиентовНаСборку</name>
  </enumValues>
  <enumValues>
    <name>ПерезаполнитьЗаявкиНаРасходованиеДС</name>
    <comment>Проект &quot;Магистраль&quot;</comment>
  </enumValues>
  <enumValues>
    <name>РассчитатьПоказателиРаботыОператоровWMS</name>
  </enumValues>
  <enumValues>
    <name>СоздатьИзменитьПодчиненнуюРеализацию</name>
  </enumValues>
  <enumValues>
    <name>СоздатьЗаказМагазина</name>
  </enumValues>
  <enumValues>
    <name>СоздатьНоменклатуруПартнера</name>
  </enumValues>
  <enumValues>
    <name>СформироватьДокументы</name>
  </enumValues>
  <enumValues>
    <name>СформироватьЗаказыКлиентов</name>
  </enumValues>
  <enumValues>
    <name>СформироватьИнтернетЗаказыКлиентов</name>
  </enumValues>
  <enumValues>
    <name>СформироватьРейсы</name>
  </enumValues>
  <enumValues>
    <name>СформироватьДвиженияМарок</name>
  </enumValues>
  <enumValues>
    <name>СформироватьОрдераНаОтражениеПересортицы</name>
  </enumValues>
  <enumValues>
    <name>АктуализироватьРезервыПриПоступленииТовара</name>
  </enumValues>
  <enumValues>
    <name>СформироватьПриходныйОрдерНаТовары</name>
  </enumValues>
  <enumValues>
    <name>СформироватьРасходныйОрдерНаТовары</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Documents/РасходныйОрдерНаТовары/ObjectModule.bsl
#Область ОбработчикиСобытий

&Перед("ПередЗаписью")
Процедура бг_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Отказ Или ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	ДополнительныеСвойства.Вставить("бг_БылПроведенДоИзменения", Проведен);
	
	бг_УстановитьПризнакКонтроляСерий();
	бг_Номенклатура.ЗаполнитьПризнакиНаличияАлкогольнойПродукцииПоНоменклатуре(ЭтотОбъект, "ОтгружаемыеТовары");
	бг_ЗаполнитьТипОтгрузкиWMS();
	
КонецПроцедуры

&После("ПриЗаписи")
Процедура бг_ПриЗаписи(Отказ)

	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
		Или ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Запись
			И ПометкаУдаления Тогда
		
		ОбновитьСостояниеПодчиненныхДокументов(Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Если бг_СталПроведенПослеИзменения() Тогда
		
		бг_ДополнитьДаннымиПоМаршрутномуЛистуОтгружаемогоИзERP();
		
		ДополнительныеСвойства.Вставить(
			"бг_Организация",
			Документы.РасходныйОрдерНаТовары.бг_ОрганизацияОрдера(Ссылка));

	КонецЕсли;
	
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура бг_ОбработкаПроведения(Отказ, РежимПроведения)
	бг_ОтразитьДополнительныеСведенияЗаказаКлиента(Отказ);
КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура бг_ОбработкаУдаленияПроведения(Отказ)
	
	бг_ОтразитьДополнительныеСведенияЗаказаКлиента(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьСостояниеПодчиненныхДокументов(Отказ)

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("бг_НеИзменятьПодчиненные")
		И ДополнительныеСвойства.бг_НеИзменятьПодчиненные Тогда
		
		Возврат;
	КонецЕсли;
	
	ПодчиненныеДокументы = Документы.РасходныйОрдерНаТовары.ПодчиненныеДокументы(Ссылка);
	
	Если ПометкаУдаления Тогда
		
		бг_РаботаСДокументами.ПометитьНаУдалениеПодчиненныйДокумент(
			ПодчиненныеДокументы,
			"битОтражениеФактаПоРасходномуОрдеру");
			
	Иначе
			
		бг_РаботаСДокументами.ОтменитьПроведениеПодчиненногоДокумента(
			ПодчиненныеДокументы,
			"битОтражениеФактаПоРасходномуОрдеру");
	КонецЕсли;

КонецПроцедуры

Процедура бг_УстановитьПризнакКонтроляСерий()

	Если Не ЗначениеЗаполнено(Склад) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Склад, "бг_ТипВнешнейСкладскойСистемы, бг_КонтролироватьСерии");
	
	Если РеквизитыДокумента.бг_ТипВнешнейСкладскойСистемы = Перечисления.бг_ТипыВнешнихСкладскихСистем.Solvo
		Или РеквизитыДокумента.бг_КонтролироватьСерии Тогда
		бг_КонтролироватьСерии = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура бг_ЗаполнитьТипОтгрузкиWMS()
	
	бг_ТипОтгрузкиWMS = Неопределено;
	
	Распоряжения = ТоварыПоРаспоряжениям.Выгрузить(, "Распоряжение");
	Распоряжения.Свернуть("Распоряжение");
	
	Распоряжение = Распоряжения[0].Распоряжение;
	
	Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		ДанныеЗаказа = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Распоряжение,
			"бг_ИсточникЗаказа, бг_ЗаказРозничногоПокупателя, бг_Магазин");
			
		Если ДанныеЗаказа.бг_ИсточникЗаказа = Перечисления.бг_ИсточникиЗагрузкиЗаказовКлиентов.WINELAB_SAP_СONSOLIDATED Тогда
				
			бг_ТипОтгрузкиWMS = Перечисления.бг_ТипыОтгрузкиWMS.ИнтернетЗаказ;
			
		ИначеЕсли ЗначениеЗаполнено(ДанныеЗаказа.бг_ЗаказРозничногоПокупателя)
			И ЗначениеЗаполнено(ДанныеЗаказа.бг_Магазин) Тогда
			
			бг_ТипОтгрузкиWMS = Перечисления.бг_ТипыОтгрузкиWMS.ПродажаЧерезМагазин;
			
		Иначе
			
			бг_ТипОтгрузкиWMS = Перечисления.бг_ТипыОтгрузкиWMS.ОптовыйЗаказ;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция бг_СталПроведенПослеИзменения()
	
	Возврат Не ДополнительныеСвойства.бг_БылПроведенДоИзменения И Проведен
			И ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение;

КонецФункции

Процедура бг_ДополнитьДаннымиПоМаршрутномуЛистуОтгружаемогоИзERP()
	
	ДанныеПоМаршрутномуЛисту= Документы.РасходныйОрдерНаТовары.бг_ДанныеМаршрутногоЛиста(Ссылка);
	
	ДополнительныеСвойства.Вставить(
		"бг_ВсеОрдераПоЗаказамМаршрутногоЛистаСозданы",
		ДанныеПоМаршрутномуЛисту.СозданыВсеОрдера);
	
	ДополнительныеСвойства.Вставить(
		"бг_СвязанныйМаршрутныйЛист",
		ДанныеПоМаршрутномуЛисту.МаршрутныйЛист);		
	
КонецПроцедуры

Процедура бг_ОтразитьДополнительныеСведенияЗаказаКлиента(Отказ)
	
	Если Отказ
		Или ДополнительныеСвойства.Свойство("бг_НеРегистрироватьПоказателиЗаказаКлиентаКОбновлению")
		И ДополнительныеСвойства.бг_НеРегистрироватьПоказателиЗаказаКлиентаКОбновлению = Истина Тогда
		Возврат;
	КонецЕсли;
	
	РаспоряженияРасходногоОрдера = бг_РаспоряженияРасходногоОрдера();
	
	Для Каждого Распоряжение Из РаспоряженияРасходногоОрдера Цикл
		
		Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			РегистрыСведений.бг_ОбъектыДляОтложеннойОбработки.ДобавитьОбъект(
				Распоряжение,
				Перечисления.бг_ВариантыОтложеннойОбработкиОбъектов.ОтразитьДополнительныеСведенияЗаказаКлиента,,
				Новый ХранилищеЗначения(
					РегистрыСведений.бг_ДополнительныеСведенияПоЗаказамКлиентов.ПоказателиПоТипуДокумента(Ссылка)));
		КонецЕсли;
			
	КонецЦикла;
		
КонецПроцедуры

Функция бг_РаспоряженияРасходногоОрдера()
	
	Возврат ОбщегоНазначения.ВыгрузитьКолонку(
		ТоварыПоРаспоряжениям,
		"Распоряжение",
		Истина);
		
КонецФункции

#КонецОбласти
